tutorials/fluidSolidInteraction/HronTurek/constant/fsiProperties
fsiProperties.iqnils