tutorials/fluidSolidInteraction/HronTurek/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    D
    {
        solver petsc;

        options
        {
            // Nonlinear solver
            snes_type newtonls;
            snes_linesearch_type basic;
            snes_rtol "1e-6";
            snes_stol "1e-6";
            snes_max_it "1000";
            snes_monitor;
            snes_converged_reason;

            snes_mf;
            snes_mf_operator;

            // Linear solver
            ksp_type lgmres;
            ksp_gmres_restart "100";
            ksp_converged_reason;

            // Store the preconditioner
            snes_lag_preconditioner_persists true;
            snes_lag_preconditioner "-2";

            // Preconditioner - LU
            pc_type bjacobi;
            sub_pc_type lu;

            // Preconditioner - ILU
            // pc_type asm;
            // sub_pc_type ilu;
            // sub_pc_factor_levels "1";

            // Preconditioner - multigrid
            // pc_type hypre;
            // pc_hypre_type boomeramg;
            // pc_hypre_boomeramg_max_iter "1";
            // //pc_hypre_boomeramg_strong_threshold "0.25";
            // pc_hypre_boomeramg_strong_threshold "0.7";
            // pc_hypre_boomeramg_grid_sweeps_up "1";
            // pc_hypre_boomeramg_grid_sweeps_down "1";
            // pc_hypre_boomeramg_agg_nl "1";
            // pc_hypre_boomeramg_agg_num_paths "1";
            // pc_hypre_boomeramg_max_levels "25";
            // pc_hypre_boomeramg_coarsen_type HMIS;
            // pc_hypre_boomeramg_interp_type ext+i;
            // pc_hypre_boomeramg_P_max "1";
            // pc_hypre_boomeramg_truncfactor "0.3";
        }
    }
}

// ************************************************************************* //
